app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)
    debugger
    if @user.save
---
INSERT INTO "users" ("full_name", "email", "session_token", "password_digest", "gender", "birth_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"